---
kind: other
id: Methods.T:Autodesk.Revit.DB.CategoryNameMapIterator
source: html/04680848-2b8c-1f82-abdc-c16515e704a5.htm
---
# CategoryNameMapIterator Methods

Causes the object to release immediately any resources it may be utilizing.